{
    "title":"DeFi Theory",
    "content":"DeFi or decentralized finance (independent financial services) is an umbrella term for financial services on public blockchains, primarily Ethereum. With DeFi, you can do most of the things that banks support — earn interest, borrow, lend, buy insurance, trade derivatives, trade assets, and more — but it’s faster and doesn’t require paperwork or a third party. As with crypto generally, DeFi is global, peer-to-peer (meaning directly between two people, not routed through a centralized system), pseudonymous, and open to all. <br></br> <h3>Benifits of DeFi</h3>  <ul><li><b>Open:</b> You don’t need to apply for anything or “open” an account. You just get access by creating a wallet.</li> <li><b>Pseudonymous:</b> You don’t need to provide your name, email address, or any personal information.</li> <li><b>Fast:</b> Interest Rates and rewards often update rapidly (as quickly as every 15 seconds), and can be significantly higher than traditional Wall Street.</li></li></ul><h3>Downsides Of DeFi:</h3><ul><li>Fluctuating transaction rates on the Ethereum blockchain mean that active trading can get expensive.</li><li>Depending on which dapps you use and how you use them, your investment could experience high volatility – this is, after all, new tech.</li><li>You have to maintain your own records for tax purposes. Regulations can vary from region to region</li></ul><h3>How does it work?</h3>DeFi, previously referred to as 'open finance', takes out the middleman in financial transactions. So instead of having your bank or credit card issuer be the intermediary between you and a merchant when you make a purchase, you use the digital currency and have ownership of it to use directly. DeFi is primarily based on Ethereum.<br></br><h3>Here are the main tenets of DeFi:</h3><ul><li>There are no intermediaries, so no banks or institutions overseeing your money</li><li>There's a level of transparency, as the code is available for anyone's review</li><li>There are many applications for users, primarily based on Ethereum</li></ul><h3>Some of the ways people are engaging with DeFi today:</h3><ul><li><b>Lending:</b> Lend out your crypto and earn interest and rewards every minute - not once per month.</li><li><b>Trading:</b> Make peer-to-peer trades of certain crypto assets — as if you could buy and sell stocks without any kind of brokerage.</li><li><b>Buying derivatives:</b> Make long or short bets on certain assets. Think of these as the crypto version of stock options or futures contracts.</li><li><b>Getting a loan:</b> Obtain a loan instantly without filling in paperwork, including extremely short-term “flash loans” that traditional financial institutions don’t offer.</li></ul>",
    "next_art":{"topic":"Minning","id":"minning"},
    "prev_art":{"topic":"Proof Of Work","id":"proof-of-work"}
}