{
    "title":"Mining",
    "content":"Crypto mining is the process of using specialized computer hardware to verify transactions on a blockchain network and earn rewards in the form of cryptocurrency. The process is also known as 'mining' because it involves solving complex mathematical problems in order to create new blocks on the blockchain.<br></br>Crypto mining can be a profitable endeavor, but it also requires a significant investment in terms of hardware and electricity. Additionally, it can be a highly competitive field, as the difficulty of solving the mathematical problems increases over time and the rewards decrease.<br></br><h3>Different methods of Mining</h3><ul><li><b>CPU mining</b> - This is a quite slow way of mining, because it takes months to earn a tiny amount of mining rewards. Also constantly running CPU at 100% of its capacity increases the electrical cost.</li><li><b>GPU mining</b> - This is a most common way of minning these days. Mining process requires higher efficiency in performing similar kinds of repetitive computations. The mining device continuously tries to decode the different hashes repeatedly with only one digit changing in each attempt. GPUs are equipped with a large number of Arithmetic Logic Units (ALU), which are responsible for performing mathematical computations. Courtesy of these ALUs, the GPU is capable of performing more calculations, leading to improved output for the crypto mining process.</li><li><b>Application-Specific Integrated Circuit (ASIC) mining</b> - This type of mining is also quite popular. These are integrated circuit chip that has been designed for a specific purpose. But they are expensive, and as more and more miners join the network and mining becomes harder, the hardware becomes obsolete quickly. A brand new ASIC would usually only last 1-2 years max</li></ul><br></br><h3>What are mining pools?</h3>Cryptocurrency mining pools are groups of miners who share their computational resources. Mining pools utilize these combined resources to strengthen the probability of finding a block or otherwise successfully mining for cryptocurrency. If the mining pool is successful and receives a reward, that reward is divided among participants in the pool.",
    "next_art":{"topic":"NFT (Non-Fungible Token)","id":"nft"},
    "prev_art":{"topic":"DeFi Theory","id":"defi-theory"}
}