{
    "title":"Proof Of Work",
    "content":"What is Proof Of Work?\\n\\n Ethereum, like Bitcoin, currently uses a consensus protocol called Proof of Work (PoW). Proof of work describes a system that requires a not-insignificant but feasible amount of effort in order to deter frivolous or malicious uses of computing power, such as sending spam emails or launching denial of service attacks.\\n\\n Later in 2022, Proof of Work will be phased out in favour of Proof of Stake with Ethereum 2.0.\\n\\n\\n How proof-of-work work?\\n\\n Bitcoin is a blockchain, which is a shared ledger that contains a history of every Bitcoin transaction that ever took place. This blockchain, as the name suggests, is composed of blocks. Each block has the most recent transactions stored in it.\\n\\nProof-of-work is a necessary part of adding new blocks to the Bitcoin blockchain. Blocks are summoned to life by miners, the players in the ecosystem who execute proof-of-work. A new block is accepted by the network each time a miner comes up with a new winning proof-of-work, which happens roughly every 10 minutes.\\n\\n Finding the winning proof-of-work is so difficult the only way to provide the work miners need to win bitcoin is with expensive, specialized computers. Miners will earn bitcoin if they guess a matching computation. The more computations they churn out, the more bitcoin they are likely to earn.\\n\\n What computations are the miners making exactly? In Bitcoin, miners spit out so-called 'hash,'' which turns an input into a random-looking string of letters and numbers.\\n\\n The goal of the miners is to create a hash matching Bitcoin's current 'target.' They must create a hash with enough zeroes in front. The probability of getting several zeros in a row is very low. But miners across the world are making trillions of such computations a second, so it takes them about 10 minutes on average to hit this target.\\n\\n Whoever reaches the goal first wins a batch of bitcoin cryptocurrency. Then the Bitcoin protocol creates a new value that miners must hash, and miners start the race for finding the winning proof-of-work all over again."
}